# Module 7 - Hands On 3 - Merge Join Concat

Step 4: Import the required packages and create two data frames.

In [1]:
import pandas as pd

In [2]:
user = pd.DataFrame({'ID': [1, 2, 3, 4], 'Name': ['a', 'b', 'c', 'd']})
user

   ID Name
0   1    a
1   2    b
2   3    c
3   4    d

In [3]:
qualifications = pd.DataFrame({'User_ID': [1, 2, 3, 4], 'qualification': ['e', 'f', 'g', 'h']})
qualifications

   User_ID qualification
0        1             e
1        2             f
2        3             g
3        4             h

Step 5: Merge the two dataframes.

In [4]:
pd.merge(user, qualifications, left_on= 'ID', right_on= 'User_ID')

   ID Name  User_ID qualification
0   1    a        1             e
1   2    b        2             f
2   3    c        3             g
3   4    d        4             h

Step 6: Create two data frames.

In [5]:
df1 = pd.DataFrame({'ID': [1, 2, 3, 4], 'Name': ['a', 'b', 'c', 'd']}).set_index('ID')
df1

   Name
ID
1     a
2     b
3     c
4     d

In [6]:
df2 = pd.DataFrame({'ID': [1, 2, 3, 4], 'Qualification': ['e', 'f', 'g', 'h']}).set_index('ID')
df2

   Qualification
ID
1              e
2              f
3              g
4              h

Step 7: Join two dataframes.

In [7]:
df1.join(df2)

   Name Qualification
ID
1     a             e
2     b             f
3     c             g
4     d             h

In [8]:
df2.join(df1)

   Qualification Name
ID
1              e    a
2              f    b
3              g    c
4              h    d

Step 8: Create 3 data frames.

In [9]:
df1 = pd.DataFrame({'ID': [0, 1, 2], 'Name': ['a', 'b', 'c']}).set_index('ID')

df2 = pd.DataFrame({'ID': [3, 4, 5], 'Name': ['d', 'e', 'f']}).set_index('ID')

df3 = pd.DataFrame({'ID': [6, 7, 8], 'Name': ['g', 'h', 'i']}).set_index('ID')

df1, df2, df3

(   Name
 ID
 0     a
 1     b
 2     c,
    Name
 ID
 3     d
 4     e
 5     f,
    Name
 ID
 6     g
 7     h
 8     i)

Step 9: Concatenate 3 data frames by them as a list in pd.concat.

In [10]:
pd.concat([df1, df2, df3])

   Name
ID
0     a
1     b
2     c
3     d
4     e
5     f
6     g
7     h
8     i